In [1]:
import pandas as pd
import numpy as np

In [2]:
demog = pd.read_csv('m5_survey_data_demographics.csv')
tech = pd.read_csv('m5_survey_data_technologies_normalised.csv')
job = pd.read_excel('01_job_postings.xlsx')
salary = pd.read_csv('04_popular-languages.csv')

In [3]:
df_demog = demog.copy()
df_tech = tech.copy()
df_job = job.copy()
df_salary = salary.copy()

In [4]:
df_demog.head(1)

,Respondent,MainBranch,Hobbyist,OpenSourcer,OpenSource,Employment,Country,Student,EdLevel,UndergradMajor,...,WelcomeChange,SONewContent,Age,Gender,Trans,Sexuality,Ethnicity,Dependents,SurveyLength,SurveyEase
0,4,I am a developer by profession,No,Never,The quality of OSS and closed source software ...,Employed full-time,United States,No,"Bachelor’s degree (BA, BS, B.Eng., etc.)","Computer science, computer engineering, or sof...",...,Just as welcome now as I felt last year,Tech articles written by other developers;Indu...,22.0,Man,No,Straight / Heterosexual,White or of European descent,No,Appropriate in length,Easy

In [5]:
df_tech.head(2)

,Respondent,LanguageWorkedWith,LanguageDesireNextYear,DatabaseWorkedWith,DatabaseDesireNextYear,PlatformWorkedWith,PlatformDesireNextYear,WebFrameWorkedWith,WebFrameDesireNextYear,DevEnviron,OpSys,Containers,BlockchainOrg,BlockchainIs
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,4.0,C,C,MySQL,MySQL,Linux,Linux,NaN,NaN,Eclipse,NaN,NaN,NaN,NaN

In [6]:
df_job.head(2)

  Technology       Location  Num_of_Jobs
0          C  San Francisco          214
1          C   Philadelphia           20

In [26]:
# From url 
df_salary.head(20).sort_values(by='Average Annual Salary', ascending=False)

    0    Language Average Annual Salary
9  10          Go               $94,082
2   3           R               $92,037
6   7          C#               $88,726
8   9         SQL               $84,793
7   8         PHP               $84,727
4   5       Swift              $130,801
0   1      Python              $114,383
5   6         C++              $113,865
3   4  Javascript              $110,981
1   2        Java              $101,013

In [31]:
df_salary.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   0                      10 non-null     int64
 1   Language               10 non-null     object
 2   Average Annual Salary  10 non-null     object
 3   Salary                 10 non-null     object
dtypes: int64(1), object(3)
memory usage: 448.0+ bytes

In [46]:
df_salary['Salary'] = df_salary['Average Annual Salary'].str.replace('$', '').str.replace(',', '').astype(int)
df_salary.head(20).sort_values(by='Salary', ascending=False)

/var/folders/ht/tcz99qld7qz6stv5g043rfyc0000gn/T/ipykernel_84850/652562040.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df_salary['Salary'] = df_salary['Average Annual Salary'].str.replace('$', '').str.replace(',', '').astype(int)

    0    Language Average Annual Salary  Salary
4   5       Swift              $130,801  130801
0   1      Python              $114,383  114383
5   6         C++              $113,865  113865
3   4  Javascript              $110,981  110981
1   2        Java              $101,013  101013
9  10          Go               $94,082   94082
2   3           R               $92,037   92037
6   7          C#               $88,726   88726
8   9         SQL               $84,793   84793
7   8         PHP               $84,727   84727

In [8]:
df_job.groupby('Location')['Num_of_Jobs'].sum().reset_index().sort_values(by='Num_of_Jobs').head()

         Location  Num_of_Jobs
9    Philadelphia           26
0          Austin          303
10  San Francisco          305
6     Los Angeles          400
7     New Orleons          605

In [9]:
df_job.groupby('Technology')['Num_of_Jobs'].sum().reset_index().sort_values(by='Num_of_Jobs').head()

          Technology  Num_of_Jobs
6       MySQL Server            0
8   PostgreSQLappend            0
11             Scala           33
5            MongoDB          174
10        SQL Server          250

In [10]:
df_jobs = pd.read_csv('jobs.csv')
top10_Laguages = ['JavaScript', 'Html', 'SQL', 'Bash', 'Python', 'Java', 'C#', 'Typescript', 'PHP', 'C+\+', 'C']
d = {'Language' : [] , 'Num_of_Jobs' : []}
for i in top10_Laguages:
    d['Language'] += [i]
    d['Num_of_Jobs'] += [df_jobs.loc[df_jobs['Key Skills'].str.contains(i), ['Key Skills']].count()[0]]
    #print(i , df_jobs.loc[df_jobs['Key Skills'].str.contains(i), ['Key Skills']].count()[0])
pd.DataFrame(data=d).sort_values(by= 'Num_of_Jobs', ascending=False)

      Language  Num_of_Jobs
10           C        13498
2          SQL         2636
5         Java         2609
4       Python         1173
8          PHP          647
0   JavaScript          355
6           C#          333
9         C+\+          305
1         Html          164
3         Bash           25
7   Typescript            1

In [11]:
df_new = df_jobs['Key Skills'].str.split('|', expand= True)
df_new.rename(columns = lambda x : 'a' + str(x), inplace=True)
for i in df_new.columns:
    df_new[i] = df_new[i].str.lower()
    df_new[i] = df_new[i].str.strip()
df_new.head(2)

,a0,a1,a2,a3,a4,a5,a6,a7,a8,a9,...,a26,a27,a28,a29,a30,a31,a32,a33,a34,a35
0,media planning,digital media,None,None,None,None,None,None,None,None,...,None,None,None,None,None,None,None,None,None,None
1,pre sales,closing,software knowledge,clients,requirements,negotiating,client,online bidding,good communication,technology,...,None,None,None,None,None,None,None,None,None,None

In [12]:
df_new.shape

(27005, 36)

In [13]:
# For Job 'C' .contains function doesn't work:
L=[]
for i in df_new.columns:
    index = df_new.loc[df_new[i] == 'c'].index
    for i in index:
        L.append(i)

len(set(L))

817

In [14]:
df_new[df_new['a0'].str.match('c')].a0

2           computer science
6           channel partners
17                 copyright
18                        c#
21       contract management
                ...
26958        computer skills
26961       customer service
26974        content writing
26997                    c++
27002              counselor
Name: a0, Length: 3625, dtype: object

In [15]:
L=[]
for i in df_new.columns:
    index = df_new.loc[df_new[i].str.contains('javascript', na=False, regex=True)].index
    for i in index:
        L.append(i)

len(set(L))

2248

In [16]:
for i in L:
    if i not in L2:
        print(i)

NameError: name 'L2' is not defined

In [17]:
L2 = df_jobs.loc[df_jobs['Key Skills'].str.contains('JavaScript')].index
print(len(L2))
L2.difference(L)

355

Int64Index([], dtype='int64')

In [18]:
df_jobs.loc[43, ['Key Skills']]

Key Skills    javascript| sql| php| php mysql| css| software...
Name: 43, dtype: object

In [19]:
df_jobs.head(1)

,Id,Job Title,Job Experience Required,Key Skills,Role Category,Location,Functional Area,Industry,Role
0,0,Digital Media Planner,5 - 10 yrs,Media Planning| Digital Media,Advertising,Los Angeles,"Marketing , Advertising , MR , PR , Media Plan...","Advertising, PR, MR, Event Management",Media Planning Executive/Manager

In [20]:
df_job.groupby('Technology')['Num_of_Jobs'].sum().reset_index().sort_values(by='Num_of_Jobs')

          Technology  Num_of_Jobs
6       MySQL Server            0
8   PostgreSQLappend            0
11             Scala           33
5            MongoDB          174
10        SQL Server          250
2                C++          305
1                 C#          333
4         JavaScript          355
7             Oracle          784
9             Python         1173
3               Java         2609
0                  C        13498

In [21]:
'''
# Install a pip package in the current Jupyter kernel
import sys
!{sys.executable} -m pip install mitosheet
'''

'\n# Install a pip package in the current Jupyter kernel\nimport sys\n!{sys.executable} -m pip install mitosheet\n'

In [22]:
import mitosheet

In [23]:
mitosheet.sheet(df_new, analysis_to_replay="id-nbfhkxiiwc")

MitoWidget(analysis_data_json='{"analysisName": "id-nbfhkxiiwc", "analysisToReplay": null, "code": [], "stepSu…

In [ ]:
from mitosheet import *; register_analysis("id-nbfhkxiiwc");
    
# Filtered a0
df_new = df_new[(df_new['a0'].str.contains('sql', na=False)) & ((df_new['a0'].apply(lambda val: all(s not in str(val) for s in ['mysql', 'nosql', 'post']))))]